; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

module asm ".section .gnu.warning.siggetmask"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.__fpending"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.gets"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.tmpnam"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.mktemp"
module asm "\09.previous"

%struct.__uclibc_locale_struct.197 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.196 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-11/lib/clang/11.0.0/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "__evoke_link_warning_siggetmask", scope: !53, file: !54, line: 31, type: !56, isLocal: true, isDefinition: true)
!53 = distinct !DICompileUnit(language: DW_LANG_C99, file: !54, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !55, splitDebugInlining: false, nameTableKind: None)
!54 = !DIFile(filename: "libc/signal/siggetmask.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!55 = !{!51}
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 456, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 57)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "__evoke_link_warning___fpending", scope: !61, file: !62, line: 24, type: !64, isLocal: true, isDefinition: true)
!61 = distinct !DICompileUnit(language: DW_LANG_C99, file: !62, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !63, splitDebugInlining: false, nameTableKind: None)
!62 = !DIFile(filename: "libc/stdio/__fpending.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!63 = !{!59}
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1336, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 167)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "__evoke_link_warning_gets", scope: !69, file: !70, line: 10, type: !56, isLocal: true, isDefinition: true)
!69 = distinct !DICompileUnit(language: DW_LANG_C99, file: !70, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !71, splitDebugInlining: false, nameTableKind: None)
!70 = !DIFile(filename: "libc/stdio/gets.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!71 = !{!67}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "__evoke_link_warning_tmpnam", scope: !74, file: !75, line: 54, type: !83, isLocal: true, isDefinition: true)
!74 = distinct !DICompileUnit(language: DW_LANG_C99, file: !75, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !76, globals: !77, splitDebugInlining: false, nameTableKind: None)
!75 = !DIFile(filename: "libc/stdio/tmpnam.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!76 = !{!6, !7}
!77 = !{!72, !78}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "tmpnam_buffer", scope: !74, file: !75, line: 25, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 20)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 440, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 55)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "__evoke_link_warning_mktemp", scope: !88, file: !89, line: 35, type: !83, isLocal: true, isDefinition: true)
!88 = distinct !DICompileUnit(language: DW_LANG_C99, file: !89, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !90, splitDebugInlining: false, nameTableKind: None)
!89 = !DIFile(filename: "libc/stdlib/mktemp.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!90 = !{!86}
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "n_calls", scope: !93, file: !94, line: 1347, type: !45, isLocal: true, isDefinition: true)
!93 = distinct !DISubprogram(name: "getcwd", scope: !94, file: !94, line: 1346, type: !95, scopeLine: 1346, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !99, retainedNodes: !4)
!94 = !DIFile(filename: "runtime/POSIX/fd.c", directory: "/home/omostafa/Documents/Software/klee")
!95 = !DISubroutineType(types: !96)
!96 = !{!7, !7, !97}
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !98, line: 46, baseType: !10)
!98 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!99 = distinct !DICompileUnit(language: DW_LANG_C89, file: !100, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !101, retainedTypes: !122, globals: !181, splitDebugInlining: false, nameTableKind: None)
!100 = !DIFile(filename: "/home/omostafa/Documents/Software/klee/runtime/POSIX/fd.c", directory: "/home/omostafa/Documents/Software/klee/build/runtime/POSIX")
!101 = !{!102, !110}
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !103, line: 51, baseType: !104, size: 32, elements: !105)
!103 = !DIFile(filename: "runtime/POSIX/fd.h", directory: "/home/omostafa/Documents/Software/klee")
!104 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!105 = !{!106, !107, !108, !109}
!106 = !DIEnumerator(name: "eOpen", value: 1, isUnsigned: true)
!107 = !DIEnumerator(name: "eCloseOnExec", value: 2, isUnsigned: true)
!108 = !DIEnumerator(name: "eReadable", value: 4, isUnsigned: true)
!109 = !DIEnumerator(name: "eWriteable", value: 8, isUnsigned: true)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !111, line: 97, baseType: !104, size: 32, elements: !112)
!111 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121}
!113 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!114 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!115 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!116 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!117 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!118 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!119 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!120 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!121 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!122 = !{!123, !6, !124, !10, !128, !7, !143, !45, !8}
!123 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !125, line: 92, baseType: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !127, line: 153, baseType: !123)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !130, line: 37, size: 2240, elements: !131)
!130 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!131 = !{!132, !134, !135, !137, !139}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !129, file: !130, line: 39, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !127, line: 149, baseType: !10)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !129, file: !130, line: 40, baseType: !126, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !129, file: !130, line: 41, baseType: !136, size: 16, offset: 128)
!136 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !129, file: !130, line: 42, baseType: !138, size: 8, offset: 144)
!138 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !129, file: !130, line: 43, baseType: !140, size: 2048, offset: 152)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 256, lowerBound: 0)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !145, line: 46, size: 1152, elements: !146)
!145 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!146 = !{!147, !149, !151, !153, !155, !157, !159, !160, !161, !163, !165, !167, !175, !176, !177}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !144, file: !145, line: 48, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !127, line: 145, baseType: !10)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !144, file: !145, line: 53, baseType: !150, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !127, line: 148, baseType: !10)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !144, file: !145, line: 61, baseType: !152, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !127, line: 151, baseType: !10)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !144, file: !145, line: 62, baseType: !154, size: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !127, line: 150, baseType: !104)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !144, file: !145, line: 64, baseType: !156, size: 32, offset: 224)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !127, line: 146, baseType: !104)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !144, file: !145, line: 65, baseType: !158, size: 32, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !127, line: 147, baseType: !104)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !144, file: !145, line: 67, baseType: !45, size: 32, offset: 288)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !144, file: !145, line: 69, baseType: !148, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !144, file: !145, line: 74, baseType: !162, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !127, line: 152, baseType: !123)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !144, file: !145, line: 78, baseType: !164, size: 64, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !127, line: 174, baseType: !123)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !144, file: !145, line: 80, baseType: !166, size: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !127, line: 179, baseType: !123)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !144, file: !145, line: 91, baseType: !168, size: 128, offset: 576)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !169, line: 10, size: 128, elements: !170)
!169 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!170 = !{!171, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !168, file: !169, line: 12, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !127, line: 160, baseType: !123)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !168, file: !169, line: 16, baseType: !174, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !127, line: 196, baseType: !123)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !144, file: !145, line: 92, baseType: !168, size: 128, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !144, file: !145, line: 93, baseType: !168, size: 128, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !144, file: !145, line: 106, baseType: !178, size: 192, offset: 960)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 192, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 3, lowerBound: 0)
!181 = !{!182, !187, !194, !201, !207, !212, !91}
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "n_calls", scope: !184, file: !94, line: 313, type: !45, isLocal: true, isDefinition: true)
!184 = distinct !DISubprogram(name: "close", scope: !94, file: !94, line: 312, type: !185, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !99, retainedNodes: !4)
!185 = !DISubroutineType(types: !186)
!186 = !{!45, !45}
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "n_calls", scope: !189, file: !94, line: 345, type: !45, isLocal: true, isDefinition: true)
!189 = distinct !DISubprogram(name: "read", scope: !94, file: !94, line: 344, type: !190, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !99, retainedNodes: !4)
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !45, !6, !97}
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !125, line: 108, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !127, line: 193, baseType: !123)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "n_calls", scope: !196, file: !94, line: 411, type: !45, isLocal: true, isDefinition: true)
!196 = distinct !DISubprogram(name: "write", scope: !94, file: !94, line: 410, type: !197, scopeLine: 410, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !99, retainedNodes: !4)
!197 = !DISubroutineType(types: !198)
!198 = !{!192, !45, !199, !97}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "n_calls", scope: !203, file: !94, line: 647, type: !45, isLocal: true, isDefinition: true)
!203 = distinct !DISubprogram(name: "chmod", scope: !94, file: !94, line: 646, type: !204, scopeLine: 646, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !99, retainedNodes: !4)
!204 = !DISubroutineType(types: !205)
!205 = !{!45, !29, !206}
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !125, line: 69, baseType: !154)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "n_calls", scope: !209, file: !94, line: 666, type: !45, isLocal: true, isDefinition: true)
!209 = distinct !DISubprogram(name: "fchmod", scope: !94, file: !94, line: 665, type: !210, scopeLine: 665, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !99, retainedNodes: !4)
!210 = !DISubroutineType(types: !211)
!211 = !{!45, !45, !206}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "n_calls", scope: !214, file: !94, line: 752, type: !45, isLocal: true, isDefinition: true)
!214 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !94, file: !94, line: 751, type: !215, scopeLine: 751, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !99, retainedNodes: !4)
!215 = !DISubroutineType(types: !216)
!216 = !{!45, !45, !124}
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "letters", scope: !219, file: !220, line: 135, type: !229, isLocal: true, isDefinition: true)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !221, globals: !222, splitDebugInlining: false, nameTableKind: None)
!220 = !DIFile(filename: "libc/misc/internals/tempname.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!221 = !{!6, !17}
!222 = !{!223, !217}
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "value", scope: !225, file: !220, line: 159, type: !17, isLocal: true, isDefinition: true)
!225 = distinct !DISubprogram(name: "brain_damaged_fillrand", scope: !220, file: !220, line: 154, type: !226, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !219, retainedNodes: !4)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !228, !104}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 504, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 63)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !234, file: !268, line: 375, type: !507, isLocal: false, isDefinition: true)
!234 = distinct !DICompileUnit(language: DW_LANG_C99, file: !235, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !236, retainedTypes: !258, globals: !310, splitDebugInlining: false, nameTableKind: None)
!235 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!236 = !{!237, !243}
!237 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !238, line: 90, baseType: !104, size: 32, elements: !239)
!238 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!239 = !{!240, !241, !242}
!240 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0, isUnsigned: true)
!241 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1, isUnsigned: true)
!242 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2, isUnsigned: true)
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !244, line: 48, baseType: !104, size: 32, elements: !245)
!244 = !DIFile(filename: "./include/ctype.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!246 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!247 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!248 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!249 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!250 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!251 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!252 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!253 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!254 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!255 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!256 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!257 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!258 = !{!45, !259, !7, !260, !262, !265, !138, !228, !266, !279, !287, !10}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !136)
!265 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !268, line: 400, baseType: !269)
!268 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !268, line: 390, size: 128, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !269, file: !268, line: 391, baseType: !264, size: 16)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !269, file: !268, line: 392, baseType: !264, size: 16, offset: 16)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !269, file: !268, line: 393, baseType: !264, size: 16, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !269, file: !268, line: 394, baseType: !264, size: 16, offset: 48)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !269, file: !268, line: 396, baseType: !264, size: 16, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !269, file: !268, line: 397, baseType: !264, size: 16, offset: 80)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !269, file: !268, line: 398, baseType: !264, size: 16, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !269, file: !268, line: 399, baseType: !264, size: 16, offset: 112)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !268, line: 430, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !268, line: 425, size: 64, elements: !282)
!282 = !{!283, !284, !285, !286}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !281, file: !268, line: 426, baseType: !264, size: 16)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !281, file: !268, line: 427, baseType: !264, size: 16, offset: 16)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !281, file: !268, line: 428, baseType: !264, size: 16, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !281, file: !268, line: 429, baseType: !264, size: 16, offset: 48)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !268, line: 423, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !268, line: 402, size: 304, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !289, file: !268, line: 403, baseType: !264, size: 16)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !289, file: !268, line: 404, baseType: !264, size: 16, offset: 16)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !289, file: !268, line: 405, baseType: !264, size: 16, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !289, file: !268, line: 406, baseType: !264, size: 16, offset: 48)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !289, file: !268, line: 407, baseType: !264, size: 16, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !289, file: !268, line: 408, baseType: !264, size: 16, offset: 80)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !289, file: !268, line: 409, baseType: !264, size: 16, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !289, file: !268, line: 410, baseType: !264, size: 16, offset: 112)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !289, file: !268, line: 411, baseType: !264, size: 16, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !289, file: !268, line: 412, baseType: !264, size: 16, offset: 144)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !289, file: !268, line: 413, baseType: !264, size: 16, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !289, file: !268, line: 414, baseType: !264, size: 16, offset: 176)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !289, file: !268, line: 415, baseType: !264, size: 16, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !289, file: !268, line: 416, baseType: !264, size: 16, offset: 208)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !289, file: !268, line: 418, baseType: !264, size: 16, offset: 224)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !289, file: !268, line: 419, baseType: !264, size: 16, offset: 240)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !289, file: !268, line: 420, baseType: !264, size: 16, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !289, file: !268, line: 421, baseType: !264, size: 16, offset: 272)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !289, file: !268, line: 422, baseType: !264, size: 16, offset: 288)
!310 = !{!311, !495, !232, !497, !500, !502}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "__global_locale", scope: !234, file: !268, line: 377, type: !313, isLocal: false, isDefinition: true)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !238, line: 330, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !238, line: 154, size: 26560, elements: !316)
!316 = !{!317, !324, !330, !331, !335, !337, !338, !342, !346, !348, !349, !350, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !369, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !315, file: !238, line: 156, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !321, line: 38, baseType: !322)
!321 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !323, line: 44, baseType: !136)
!323 = !DIFile(filename: "./include/bits/types.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !315, file: !238, line: 157, baseType: !325, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !321, line: 42, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !323, line: 43, baseType: !329)
!329 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !315, file: !238, line: 158, baseType: !325, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !315, file: !238, line: 162, baseType: !332, size: 6144, offset: 192)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 6144, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !315, file: !238, line: 163, baseType: !336, size: 6144, offset: 6336)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 6144, elements: !333)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !315, file: !238, line: 164, baseType: !336, size: 6144, offset: 12480)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !315, file: !238, line: 168, baseType: !339, size: 112, offset: 18624)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 112, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 14)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !315, file: !238, line: 174, baseType: !343, size: 96, offset: 18736)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 96, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 6)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !315, file: !238, line: 175, baseType: !347, size: 48, offset: 18832)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 48, elements: !344)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !315, file: !238, line: 178, baseType: !138, size: 8, offset: 18880)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !315, file: !238, line: 179, baseType: !138, size: 8, offset: 18888)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !315, file: !238, line: 180, baseType: !351, size: 80, offset: 18896)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 80, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 10)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !315, file: !238, line: 183, baseType: !260, size: 64, offset: 19008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !315, file: !238, line: 184, baseType: !260, size: 64, offset: 19072)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !315, file: !238, line: 185, baseType: !260, size: 64, offset: 19136)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !315, file: !238, line: 186, baseType: !260, size: 64, offset: 19200)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !315, file: !238, line: 188, baseType: !260, size: 64, offset: 19264)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !315, file: !238, line: 189, baseType: !262, size: 64, offset: 19328)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !315, file: !238, line: 190, baseType: !260, size: 64, offset: 19392)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !315, file: !238, line: 191, baseType: !260, size: 64, offset: 19456)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !315, file: !238, line: 197, baseType: !262, size: 64, offset: 19520)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !315, file: !238, line: 199, baseType: !260, size: 64, offset: 19584)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !315, file: !238, line: 200, baseType: !260, size: 64, offset: 19648)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !315, file: !238, line: 202, baseType: !366, size: 64, offset: 19712)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !329)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !315, file: !238, line: 205, baseType: !370, size: 32, offset: 19776)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !315, file: !238, line: 206, baseType: !370, size: 32, offset: 19808)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !315, file: !238, line: 207, baseType: !45, size: 32, offset: 19840)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !315, file: !238, line: 208, baseType: !45, size: 32, offset: 19872)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !315, file: !238, line: 213, baseType: !29, size: 64, offset: 19904)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !315, file: !238, line: 214, baseType: !29, size: 64, offset: 19968)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !315, file: !238, line: 215, baseType: !29, size: 64, offset: 20032)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !315, file: !238, line: 216, baseType: !29, size: 64, offset: 20096)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !315, file: !238, line: 217, baseType: !29, size: 64, offset: 20160)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !315, file: !238, line: 218, baseType: !29, size: 64, offset: 20224)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !315, file: !238, line: 219, baseType: !29, size: 64, offset: 20288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !315, file: !238, line: 220, baseType: !29, size: 64, offset: 20352)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !315, file: !238, line: 221, baseType: !29, size: 64, offset: 20416)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !315, file: !238, line: 222, baseType: !29, size: 64, offset: 20480)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !315, file: !238, line: 223, baseType: !29, size: 64, offset: 20544)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !315, file: !238, line: 226, baseType: !29, size: 64, offset: 20608)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !315, file: !238, line: 227, baseType: !29, size: 64, offset: 20672)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !315, file: !238, line: 228, baseType: !29, size: 64, offset: 20736)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !315, file: !238, line: 231, baseType: !29, size: 64, offset: 20800)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !315, file: !238, line: 232, baseType: !29, size: 64, offset: 20864)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !315, file: !238, line: 233, baseType: !29, size: 64, offset: 20928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !315, file: !238, line: 234, baseType: !29, size: 64, offset: 20992)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !315, file: !238, line: 235, baseType: !29, size: 64, offset: 21056)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !315, file: !238, line: 236, baseType: !29, size: 64, offset: 21120)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !315, file: !238, line: 237, baseType: !29, size: 64, offset: 21184)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !315, file: !238, line: 238, baseType: !29, size: 64, offset: 21248)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !315, file: !238, line: 239, baseType: !29, size: 64, offset: 21312)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !315, file: !238, line: 240, baseType: !29, size: 64, offset: 21376)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !315, file: !238, line: 241, baseType: !29, size: 64, offset: 21440)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !315, file: !238, line: 242, baseType: !29, size: 64, offset: 21504)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !315, file: !238, line: 243, baseType: !29, size: 64, offset: 21568)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !315, file: !238, line: 244, baseType: !29, size: 64, offset: 21632)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !315, file: !238, line: 245, baseType: !29, size: 64, offset: 21696)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !315, file: !238, line: 246, baseType: !29, size: 64, offset: 21760)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !315, file: !238, line: 247, baseType: !29, size: 64, offset: 21824)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !315, file: !238, line: 248, baseType: !29, size: 64, offset: 21888)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !315, file: !238, line: 249, baseType: !29, size: 64, offset: 21952)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !315, file: !238, line: 250, baseType: !29, size: 64, offset: 22016)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !315, file: !238, line: 251, baseType: !29, size: 64, offset: 22080)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !315, file: !238, line: 253, baseType: !29, size: 64, offset: 22144)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !315, file: !238, line: 256, baseType: !29, size: 64, offset: 22208)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !315, file: !238, line: 257, baseType: !29, size: 64, offset: 22272)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !315, file: !238, line: 258, baseType: !29, size: 64, offset: 22336)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !315, file: !238, line: 259, baseType: !29, size: 64, offset: 22400)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !315, file: !238, line: 260, baseType: !29, size: 64, offset: 22464)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !315, file: !238, line: 261, baseType: !29, size: 64, offset: 22528)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !315, file: !238, line: 262, baseType: !29, size: 64, offset: 22592)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !315, file: !238, line: 264, baseType: !29, size: 64, offset: 22656)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !315, file: !238, line: 265, baseType: !29, size: 64, offset: 22720)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !315, file: !238, line: 266, baseType: !29, size: 64, offset: 22784)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !315, file: !238, line: 267, baseType: !29, size: 64, offset: 22848)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !315, file: !238, line: 268, baseType: !29, size: 64, offset: 22912)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !315, file: !238, line: 269, baseType: !29, size: 64, offset: 22976)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !315, file: !238, line: 270, baseType: !29, size: 64, offset: 23040)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !315, file: !238, line: 272, baseType: !29, size: 64, offset: 23104)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !315, file: !238, line: 273, baseType: !29, size: 64, offset: 23168)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !315, file: !238, line: 274, baseType: !29, size: 64, offset: 23232)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !315, file: !238, line: 275, baseType: !29, size: 64, offset: 23296)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !315, file: !238, line: 276, baseType: !29, size: 64, offset: 23360)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !315, file: !238, line: 277, baseType: !29, size: 64, offset: 23424)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !315, file: !238, line: 278, baseType: !29, size: 64, offset: 23488)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !315, file: !238, line: 279, baseType: !29, size: 64, offset: 23552)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !315, file: !238, line: 280, baseType: !29, size: 64, offset: 23616)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !315, file: !238, line: 281, baseType: !29, size: 64, offset: 23680)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !315, file: !238, line: 282, baseType: !29, size: 64, offset: 23744)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !315, file: !238, line: 283, baseType: !29, size: 64, offset: 23808)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !315, file: !238, line: 285, baseType: !29, size: 64, offset: 23872)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !315, file: !238, line: 286, baseType: !29, size: 64, offset: 23936)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !315, file: !238, line: 287, baseType: !29, size: 64, offset: 24000)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !315, file: !238, line: 288, baseType: !29, size: 64, offset: 24064)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !315, file: !238, line: 289, baseType: !29, size: 64, offset: 24128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !315, file: !238, line: 290, baseType: !29, size: 64, offset: 24192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !315, file: !238, line: 291, baseType: !29, size: 64, offset: 24256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !315, file: !238, line: 292, baseType: !29, size: 64, offset: 24320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !315, file: !238, line: 293, baseType: !29, size: 64, offset: 24384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !315, file: !238, line: 294, baseType: !29, size: 64, offset: 24448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !315, file: !238, line: 295, baseType: !29, size: 64, offset: 24512)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !315, file: !238, line: 296, baseType: !29, size: 64, offset: 24576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !315, file: !238, line: 298, baseType: !29, size: 64, offset: 24640)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !315, file: !238, line: 299, baseType: !29, size: 64, offset: 24704)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !315, file: !238, line: 301, baseType: !29, size: 64, offset: 24768)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !315, file: !238, line: 302, baseType: !29, size: 64, offset: 24832)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !315, file: !238, line: 303, baseType: !29, size: 64, offset: 24896)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !315, file: !238, line: 304, baseType: !29, size: 64, offset: 24960)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !315, file: !238, line: 305, baseType: !29, size: 64, offset: 25024)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !315, file: !238, line: 307, baseType: !29, size: 64, offset: 25088)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !315, file: !238, line: 308, baseType: !29, size: 64, offset: 25152)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !315, file: !238, line: 309, baseType: !29, size: 64, offset: 25216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !315, file: !238, line: 310, baseType: !29, size: 64, offset: 25280)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !315, file: !238, line: 311, baseType: !29, size: 64, offset: 25344)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !315, file: !238, line: 316, baseType: !29, size: 64, offset: 25408)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !315, file: !238, line: 317, baseType: !29, size: 64, offset: 25472)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !315, file: !238, line: 318, baseType: !29, size: 64, offset: 25536)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !315, file: !238, line: 319, baseType: !29, size: 64, offset: 25600)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !315, file: !238, line: 322, baseType: !465, size: 896, offset: 25664)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !238, line: 149, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 111, size: 896, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !493, !494}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !466, file: !238, line: 112, baseType: !264, size: 16)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !466, file: !238, line: 113, baseType: !264, size: 16, offset: 16)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !466, file: !238, line: 114, baseType: !264, size: 16, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !466, file: !238, line: 115, baseType: !264, size: 16, offset: 48)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !466, file: !238, line: 116, baseType: !264, size: 16, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !466, file: !238, line: 117, baseType: !264, size: 16, offset: 80)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !466, file: !238, line: 118, baseType: !264, size: 16, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !466, file: !238, line: 119, baseType: !264, size: 16, offset: 112)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !466, file: !238, line: 120, baseType: !264, size: 16, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !466, file: !238, line: 121, baseType: !264, size: 16, offset: 144)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !466, file: !238, line: 122, baseType: !264, size: 16, offset: 160)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !466, file: !238, line: 123, baseType: !264, size: 16, offset: 176)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !466, file: !238, line: 124, baseType: !264, size: 16, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !466, file: !238, line: 125, baseType: !264, size: 16, offset: 208)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !466, file: !238, line: 127, baseType: !264, size: 16, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !466, file: !238, line: 128, baseType: !264, size: 16, offset: 240)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !466, file: !238, line: 130, baseType: !262, size: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !466, file: !238, line: 131, baseType: !262, size: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !466, file: !238, line: 132, baseType: !262, size: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !466, file: !238, line: 135, baseType: !262, size: 64, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !466, file: !238, line: 138, baseType: !262, size: 64, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !466, file: !238, line: 141, baseType: !262, size: 64, offset: 576)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !466, file: !238, line: 142, baseType: !262, size: 64, offset: 640)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !466, file: !238, line: 145, baseType: !492, size: 64, offset: 704)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !466, file: !238, line: 146, baseType: !492, size: 64, offset: 768)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !466, file: !238, line: 148, baseType: !264, size: 16, offset: 832)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !234, file: !268, line: 380, type: !313, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "utf8", scope: !234, file: !268, line: 387, type: !499, isLocal: true, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !344)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "ascii", scope: !234, file: !268, line: 388, type: !499, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "__code2flag", scope: !234, file: !268, line: 854, type: !504, isLocal: true, isDefinition: true)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 256, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 16)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !238, line: 324, baseType: !315)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "stdin", scope: !510, file: !511, line: 154, type: !515, isLocal: false, isDefinition: true)
!510 = distinct !DICompileUnit(language: DW_LANG_C99, file: !511, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !512, splitDebugInlining: false, nameTableKind: None)
!511 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!512 = !{!508, !513, !545, !547, !549, !551, !553}
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "stdout", scope: !510, file: !511, line: 155, type: !515, isLocal: false, isDefinition: true)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !517, line: 46, baseType: !518)
!517 = !DIFile(filename: "./include/stdio.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !519, line: 233, size: 704, elements: !520)
!519 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!520 = !{!521, !522, !526, !527, !528, !529, !530, !531, !532, !533, !535, !537, !544}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !518, file: !519, line: 234, baseType: !136, size: 16)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !518, file: !519, line: 237, baseType: !523, size: 16, offset: 16)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 16, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 2)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !518, file: !519, line: 244, baseType: !45, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !518, file: !519, line: 246, baseType: !228, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !518, file: !519, line: 247, baseType: !228, size: 64, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !518, file: !519, line: 248, baseType: !228, size: 64, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !518, file: !519, line: 249, baseType: !228, size: 64, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !518, file: !519, line: 252, baseType: !228, size: 64, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !518, file: !519, line: 255, baseType: !228, size: 64, offset: 384)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !518, file: !519, line: 261, baseType: !534, size: 64, offset: 448)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !518, file: !519, line: 268, baseType: !536, size: 64, offset: 512)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 64, elements: !524)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !518, file: !519, line: 271, baseType: !538, size: 64, offset: 576)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !539, line: 85, baseType: !540)
!539 = !DIFile(filename: "./include/wchar.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 81, size: 64, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !540, file: !539, line: 83, baseType: !370, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !540, file: !539, line: 84, baseType: !370, size: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !518, file: !519, line: 274, baseType: !6, size: 64, offset: 640)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "stderr", scope: !510, file: !511, line: 156, type: !515, isLocal: false, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "__stdin", scope: !510, file: !511, line: 159, type: !515, isLocal: false, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "__stdout", scope: !510, file: !511, line: 162, type: !515, isLocal: false, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !510, file: !511, line: 180, type: !515, isLocal: false, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !510, file: !511, line: 131, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 2112, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 3)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !560, file: !561, line: 49, type: !45, isLocal: true, isDefinition: true)
!560 = distinct !DICompileUnit(language: DW_LANG_C99, file: !561, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !562, globals: !576, splitDebugInlining: false, nameTableKind: None)
!561 = !DIFile(filename: "libc/stdlib/abort.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!562 = !{!563, !6, !572}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !565, line: 50, baseType: !566)
!565 = !DIFile(filename: "./include/signal.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !567, line: 31, baseType: !568)
!567 = !DIFile(filename: "./include/bits/sigset.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 28, size: 1024, elements: !569)
!569 = !{!570}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !568, file: !567, line: 30, baseType: !571, size: 1024)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !505)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !565, line: 75, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !45}
!576 = !{!558}
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !579, file: !582, line: 309, type: !573, isLocal: false, isDefinition: true)
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !580, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !581, splitDebugInlining: false, nameTableKind: None)
!580 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!581 = !{!577}
!582 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "__exe_env", scope: !585, file: !590, line: 34, type: !638, isLocal: false, isDefinition: true)
!585 = distinct !DICompileUnit(language: DW_LANG_C89, file: !586, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !587, splitDebugInlining: false, nameTableKind: None)
!586 = !DIFile(filename: "/home/omostafa/Documents/Software/klee/runtime/POSIX/fd_init.c", directory: "/home/omostafa/Documents/Software/klee/build/runtime/POSIX")
!587 = !{!583, !588}
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "__exe_fs", scope: !585, file: !590, line: 21, type: !591, isLocal: false, isDefinition: true)
!590 = !DIFile(filename: "runtime/POSIX/fd_init.c", directory: "/home/omostafa/Documents/Software/klee")
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_system_t", file: !103, line: 79, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 67, size: 832, elements: !593)
!593 = !{!594, !595, !626, !627, !628, !629, !630, !632, !633, !634, !635, !636, !637}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "n_sym_files", scope: !592, file: !103, line: 68, baseType: !104, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdin", scope: !592, file: !103, line: 69, baseType: !596, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_disk_file_t", file: !103, line: 49, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 45, size: 192, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !598, file: !103, line: 46, baseType: !104, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !598, file: !103, line: 47, baseType: !7, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !598, file: !103, line: 48, baseType: !603, size: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !145, line: 119, size: 1152, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !618, !623, !624, !625}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !604, file: !145, line: 121, baseType: !148, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !604, file: !145, line: 123, baseType: !133, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !604, file: !145, line: 124, baseType: !152, size: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !604, file: !145, line: 125, baseType: !154, size: 32, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !604, file: !145, line: 132, baseType: !156, size: 32, offset: 224)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !604, file: !145, line: 133, baseType: !158, size: 32, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !604, file: !145, line: 135, baseType: !45, size: 32, offset: 288)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !604, file: !145, line: 136, baseType: !148, size: 64, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !604, file: !145, line: 137, baseType: !162, size: 64, offset: 384)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !604, file: !145, line: 143, baseType: !164, size: 64, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !604, file: !145, line: 144, baseType: !617, size: 64, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !127, line: 180, baseType: !123)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !604, file: !145, line: 152, baseType: !619, size: 128, offset: 576)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !169, line: 10, size: 128, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !619, file: !169, line: 12, baseType: !172, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !619, file: !169, line: 16, baseType: !174, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !604, file: !145, line: 153, baseType: !619, size: 128, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !604, file: !145, line: 154, baseType: !619, size: 128, offset: 832)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !604, file: !145, line: 164, baseType: !178, size: 192, offset: 960)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdout", scope: !592, file: !103, line: 69, baseType: !596, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_writes", scope: !592, file: !103, line: 70, baseType: !104, size: 32, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "sym_files", scope: !592, file: !103, line: 71, baseType: !596, size: 64, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "max_failures", scope: !592, file: !103, line: 74, baseType: !104, size: 32, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "read_fail", scope: !592, file: !103, line: 77, baseType: !631, size: 64, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "write_fail", scope: !592, file: !103, line: 77, baseType: !631, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "close_fail", scope: !592, file: !103, line: 77, baseType: !631, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ftruncate_fail", scope: !592, file: !103, line: 77, baseType: !631, size: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "getcwd_fail", scope: !592, file: !103, line: 77, baseType: !631, size: 64, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "chmod_fail", scope: !592, file: !103, line: 78, baseType: !631, size: 64, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "fchmod_fail", scope: !592, file: !103, line: 78, baseType: !631, size: 64, offset: 768)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_sym_env_t", file: !103, line: 94, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 86, size: 6272, elements: !640)
!640 = !{!641, !652, !653, !654}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !639, file: !103, line: 87, baseType: !642, size: 6144)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 6144, elements: !650)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_t", file: !103, line: 65, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 58, size: 192, elements: !645)
!645 = !{!646, !647, !648, !649}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !644, file: !103, line: 59, baseType: !45, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !644, file: !103, line: 60, baseType: !104, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !644, file: !103, line: 63, baseType: !124, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "dfile", scope: !644, file: !103, line: 64, baseType: !596, size: 64, offset: 128)
!650 = !{!651}
!651 = !DISubrange(count: 32, lowerBound: 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "umask", scope: !639, file: !103, line: 88, baseType: !206, size: 32, offset: 6144)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !639, file: !103, line: 89, baseType: !104, size: 32, offset: 6176)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "save_all_writes", scope: !639, file: !103, line: 93, baseType: !45, size: 32, offset: 6208)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "__locale_mmap", scope: !657, file: !658, line: 20149, type: !813, isLocal: false, isDefinition: true)
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !659, splitDebugInlining: false, nameTableKind: None)
!658 = !DIFile(filename: "extra/locale/locale_data.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!659 = !{!655, !660}
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "locale_mmap", scope: !657, file: !658, line: 11, type: !662, isLocal: true, isDefinition: true)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_mmap_t", file: !664, line: 91, baseType: !665)
!664 = !DIFile(filename: "./extra/locale/locale_mmap.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !664, line: 31, size: 2047232, elements: !666)
!666 = !{!667, !671, !675, !679, !683, !687, !691, !695, !699, !703, !707, !711, !715, !732, !734, !736, !738, !742, !744, !748, !752, !756, !760, !764, !768, !772, !776, !780, !784, !788, !789, !793, !797, !801, !805, !809}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !665, file: !664, line: 37, baseType: !668, size: 3360)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 3360, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 420)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !665, file: !664, line: 38, baseType: !672, size: 4032, offset: 3360)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 4032, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 504)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !665, file: !664, line: 40, baseType: !676, size: 28160, offset: 7392)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 28160, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 1760)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !665, file: !664, line: 41, baseType: !680, size: 36224, offset: 35552)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 36224, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 4528)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !665, file: !664, line: 46, baseType: !684, size: 28832, offset: 71776)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 28832, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 3604)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !665, file: !664, line: 47, baseType: !688, size: 13440, offset: 100608)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 13440, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 1680)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !665, file: !664, line: 48, baseType: !692, size: 3136, offset: 114048)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 3136, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 196)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_data", scope: !665, file: !664, line: 53, baseType: !696, size: 408, offset: 117184)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 408, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 51)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_data", scope: !665, file: !664, line: 54, baseType: !700, size: 224, offset: 117592)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 224, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 28)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_data", scope: !665, file: !664, line: 55, baseType: !704, size: 13168, offset: 117816)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 13168, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 1646)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_data", scope: !665, file: !664, line: 56, baseType: !708, size: 226824, offset: 130984)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 226824, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 28353)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_data", scope: !665, file: !664, line: 58, baseType: !712, size: 14432, offset: 357808)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 14432, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 1804)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_8_bit", scope: !665, file: !664, line: 62, baseType: !716, size: 15824, offset: 372240)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !717, size: 15824, elements: !730)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__codeset_8_bit_t", file: !719, line: 21, baseType: !720)
!719 = !DIFile(filename: "./extra/locale/c8tables.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !719, line: 16, size: 688, elements: !721)
!721 = !{!722, !724, !725, !726}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !720, file: !719, line: 17, baseType: !723, size: 128)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 128, elements: !505)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !720, file: !719, line: 18, baseType: !723, size: 128, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !720, file: !719, line: 19, baseType: !723, size: 128, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !720, file: !719, line: 20, baseType: !727, size: 304, offset: 384)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 304, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 38)
!730 = !{!731}
!731 = !DISubrange(count: 23)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_rows", scope: !665, file: !664, line: 65, baseType: !733, size: 160, offset: 388064)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 160, elements: !81)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_offsets", scope: !665, file: !664, line: 65, baseType: !735, size: 160, offset: 388224)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 160, elements: !352)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_idx", scope: !665, file: !664, line: 65, baseType: !737, size: 320, offset: 388384)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 320, elements: !81)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_rows", scope: !665, file: !664, line: 66, baseType: !739, size: 360, offset: 388704)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 360, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 45)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_offsets", scope: !665, file: !664, line: 66, baseType: !743, size: 48, offset: 389072)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 48, elements: !556)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_idx", scope: !665, file: !664, line: 66, baseType: !745, size: 240, offset: 389120)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 240, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 15)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_rows", scope: !665, file: !664, line: 67, baseType: !749, size: 31152, offset: 389360)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 31152, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 3894)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_offsets", scope: !665, file: !664, line: 67, baseType: !753, size: 352, offset: 420512)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 352, elements: !754)
!754 = !{!755}
!755 = !DISubrange(count: 22)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_idx", scope: !665, file: !664, line: 67, baseType: !757, size: 6512, offset: 420864)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 6512, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 407)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_rows", scope: !665, file: !664, line: 68, baseType: !761, size: 66000, offset: 427376)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 66000, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 8250)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_offsets", scope: !665, file: !664, line: 68, baseType: !765, size: 800, offset: 493376)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 800, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 50)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_idx", scope: !665, file: !664, line: 68, baseType: !769, size: 54864, offset: 494176)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 54864, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 3429)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_rows", scope: !665, file: !664, line: 70, baseType: !773, size: 2976, offset: 549040)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 2976, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 372)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_offsets", scope: !665, file: !664, line: 70, baseType: !777, size: 64, offset: 552016)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 64, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 4)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_idx", scope: !665, file: !664, line: 70, baseType: !781, size: 3200, offset: 552080)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 3200, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 200)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "collate_data", scope: !665, file: !664, line: 72, baseType: !785, size: 1458256, offset: 555280)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 1458256, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 91141)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_item_offsets_LEN", scope: !665, file: !664, line: 74, baseType: !347, size: 48, offset: 2013536)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_tbl_offsets", scope: !665, file: !664, line: 75, baseType: !790, size: 1536, offset: 2013632)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1536, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 24)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "locales", scope: !665, file: !664, line: 80, baseType: !794, size: 22608, offset: 2015168)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 22608, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 2826)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "locale_names5", scope: !665, file: !664, line: 81, baseType: !798, size: 6680, offset: 2037776)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 6680, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 835)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "locale_at_modifiers", scope: !665, file: !664, line: 82, baseType: !802, size: 144, offset: 2044456)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 144, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 18)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lc_names", scope: !665, file: !664, line: 85, baseType: !806, size: 552, offset: 2044600)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 552, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 69)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_list", scope: !665, file: !664, line: 87, baseType: !810, size: 2040, offset: 2045152)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 2040, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 255)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "__C_ctype_b_data", scope: !816, file: !821, line: 471, type: !822, isLocal: false, isDefinition: true)
!816 = distinct !DICompileUnit(language: DW_LANG_C99, file: !817, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !818, splitDebugInlining: false, nameTableKind: None)
!817 = !DIFile(filename: "libc/misc/ctype/__C_ctype_b.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!818 = !{!814, !819}
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "__C_ctype_b", scope: !816, file: !821, line: 862, type: !318, isLocal: false, isDefinition: true)
!821 = !DIFile(filename: "libc/misc/ctype/ctype.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 6144, elements: !333)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "__C_ctype_tolower_data", scope: !825, file: !821, line: 878, type: !830, isLocal: false, isDefinition: true)
!825 = distinct !DICompileUnit(language: DW_LANG_C99, file: !826, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !827, splitDebugInlining: false, nameTableKind: None)
!826 = !DIFile(filename: "libc/misc/ctype/__C_ctype_tolower.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!827 = !{!823, !828}
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "__C_ctype_tolower", scope: !825, file: !821, line: 981, type: !325, isLocal: false, isDefinition: true)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 6144, elements: !333)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "__C_ctype_toupper_data", scope: !833, file: !821, line: 1000, type: !830, isLocal: false, isDefinition: true)
!833 = distinct !DICompileUnit(language: DW_LANG_C99, file: !834, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !835, splitDebugInlining: false, nameTableKind: None)
!834 = !DIFile(filename: "libc/misc/ctype/__C_ctype_toupper.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!835 = !{!831, !836}
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "__C_ctype_toupper", scope: !833, file: !821, line: 1103, type: !325, isLocal: false, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "errno", scope: !840, file: !841, line: 7, type: !45, isLocal: false, isDefinition: true)
!840 = distinct !DICompileUnit(language: DW_LANG_C99, file: !841, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !842, splitDebugInlining: false, nameTableKind: None)
!841 = !DIFile(filename: "libc/misc/internals/errno.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!842 = !{!838, !843}
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "h_errno", scope: !840, file: !841, line: 8, type: !45, isLocal: false, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "static_fd", scope: !847, file: !848, line: 39, type: !45, isLocal: true, isDefinition: true)
!847 = distinct !DICompileUnit(language: DW_LANG_C99, file: !848, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !849, globals: !890, splitDebugInlining: false, nameTableKind: None)
!848 = !DIFile(filename: "libc/misc/utmp/utent.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!849 = !{!6, !850, !853, !7}
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !851, line: 88, baseType: !852)
!851 = !DIFile(filename: "./include/sys/types.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !323, line: 145, baseType: !123)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmp", file: !855, line: 60, size: 3200, elements: !856)
!855 = !DIFile(filename: "./include/bits/utmp.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!856 = !{!857, !858, !861, !865, !867, !868, !872, !877, !878, !886, !889}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !854, file: !855, line: 62, baseType: !329, size: 16)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !854, file: !855, line: 63, baseType: !859, size: 32, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !851, line: 100, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !323, line: 147, baseType: !45)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !854, file: !855, line: 64, baseType: !862, size: 256, offset: 64)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !854, file: !855, line: 65, baseType: !866, size: 32, offset: 320)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !778)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !854, file: !855, line: 66, baseType: !862, size: 256, offset: 352)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !854, file: !855, line: 67, baseType: !869, size: 2048, offset: 608)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !854, file: !855, line: 68, baseType: !873, size: 32, offset: 2656)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exit_status", file: !855, line: 52, size: 32, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !873, file: !855, line: 54, baseType: !329, size: 16)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !873, file: !855, line: 55, baseType: !329, size: 16, offset: 16)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !854, file: !855, line: 81, baseType: !123, size: 64, offset: 2688)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !854, file: !855, line: 82, baseType: !879, size: 128, offset: 2752)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !880, line: 73, size: 128, elements: !881)
!880 = !DIFile(filename: "./include/bits/time.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!881 = !{!882, !884}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !879, file: !880, line: 75, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !323, line: 153, baseType: !123)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !879, file: !880, line: 76, baseType: !885, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !323, line: 155, baseType: !123)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !854, file: !855, line: 85, baseType: !887, size: 128, offset: 2880)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 128, elements: !778)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !18, line: 41, baseType: !45)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !854, file: !855, line: 86, baseType: !80, size: 160, offset: 3008)
!890 = !{!845, !891, !893, !895}
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "static_utmp", scope: !847, file: !848, line: 40, type: !854, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "static_ut_name", scope: !847, file: !848, line: 42, type: !29, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "default_file_name", scope: !847, file: !848, line: 41, type: !897, isLocal: true, isDefinition: true)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 112, elements: !340)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "spec_base", scope: !900, file: !901, line: 1441, type: !1038, isLocal: true, isDefinition: true)
!900 = distinct !DISubprogram(name: "_do_one_spec", scope: !901, file: !901, line: 1438, type: !902, scopeLine: 1440, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !979, retainedNodes: !4)
!901 = !DIFile(filename: "libc/stdio/_vfprintf.c", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!902 = !DISubroutineType(types: !903)
!903 = !{!45, !904, !928, !631}
!904 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !517, line: 46, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !519, line: 233, size: 704, elements: !908)
!908 = !{!909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !920, !921, !927}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !907, file: !519, line: 234, baseType: !136, size: 16)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !907, file: !519, line: 237, baseType: !523, size: 16, offset: 16)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !907, file: !519, line: 244, baseType: !45, size: 32, offset: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !907, file: !519, line: 246, baseType: !228, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !907, file: !519, line: 247, baseType: !228, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !907, file: !519, line: 248, baseType: !228, size: 64, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !907, file: !519, line: 249, baseType: !228, size: 64, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !907, file: !519, line: 252, baseType: !228, size: 64, offset: 320)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !907, file: !519, line: 255, baseType: !228, size: 64, offset: 384)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !907, file: !519, line: 261, baseType: !919, size: 64, offset: 448)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !907, file: !519, line: 268, baseType: !536, size: 64, offset: 512)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !907, file: !519, line: 271, baseType: !922, size: 64, offset: 576)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !539, line: 85, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 81, size: 64, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !923, file: !539, line: 83, baseType: !370, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !923, file: !539, line: 84, baseType: !370, size: 32, offset: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !907, file: !519, line: 274, baseType: !6, size: 64, offset: 640)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "ppfs_t", file: !901, line: 419, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !901, line: 400, size: 2048, elements: !931)
!931 = !{!932, !933, !942, !943, !944, !945, !947, !951, !965}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "fmtpos", scope: !930, file: !901, line: 401, baseType: !29, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !930, file: !901, line: 402, baseType: !934, size: 160, offset: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "printf_info", file: !935, line: 55, size: 160, elements: !936)
!935 = !DIFile(filename: "./include/printf.h", directory: "/home/omostafa/Documents/Software/klee-uclibc")
!936 = !{!937, !938, !939, !940, !941}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !934, file: !935, line: 57, baseType: !45, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !934, file: !935, line: 58, baseType: !45, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !934, file: !935, line: 60, baseType: !370, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !934, file: !935, line: 107, baseType: !104, size: 32, offset: 96)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !934, file: !935, line: 141, baseType: !370, size: 32, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "maxposarg", scope: !930, file: !901, line: 404, baseType: !45, size: 32, offset: 224)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "num_data_args", scope: !930, file: !901, line: 406, baseType: !45, size: 32, offset: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "conv_num", scope: !930, file: !901, line: 407, baseType: !104, size: 32, offset: 288)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "argnumber", scope: !930, file: !901, line: 408, baseType: !946, size: 32, offset: 320)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 32, elements: !778)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "argtype", scope: !930, file: !901, line: 409, baseType: !948, size: 288, offset: 352)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 288, elements: !949)
!949 = !{!950}
!950 = !DISubrange(count: 9)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !930, file: !901, line: 410, baseType: !952, size: 192, offset: 640)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !953, line: 14, baseType: !954)
!953 = !DIFile(filename: "/usr/lib/llvm-11/lib/clang/11.0.0/include/stdarg.h", directory: "")
